local AddOnName, ns = ...;

local HEROISM	= UnitFactionGroup("player") == "Horde" and 2825 or 32182	-- Героизм\жажда крови
local REBIRTH 	= GetSpellInfo(20484)										-- Возрождение
local HOP 		= GetSpellInfo(1022)										-- Длань защиты
local SOUL_STONE = GetSpellInfo(20707)										-- Воскрешение камнем души
local CABLES	= GetSpellInfo(54732)										-- Гномий дефибриллятор 


-- ритуалы

ns.rituals  = {
	-- Маг
	[58659] = true, -- Обряд сотворения яств
	-- Лок
	[58887] = true, -- Ритуал душ
	[698]	= true, -- Ритуал призыва
}

-- спелы применяемые на членов рейда
ns.spells = {
    [74320] = false, -- жнец душ
    [73797] = false, -- жнец душ
    [73798] = false, -- жнец душ
    [73799] = false, -- жнец душ
	-- Паладин
	[6940] 	= false,	-- Длань жертвенности
	[20233] = false, -- Возложение рук
	[20236] = false, -- Возложение рук
	[1044] = false, -- Длань свободы
	[1038] = false, -- Длань спасения
	[10278] = false, -- Длань защиты
    [19752] = false, -- Божественное вмешательство
	-- Priest
	[47788] = false, -- Оберегающий дух
	[33206] = false, -- Подавление боли
	[6346] = false, -- Защита от страха
	-- Hunter
	[34477] = false, -- Перенаправление
	[19801] = false, -- Усмиряющий выстрел
	[20736] = false, -- Отвлекающий выстрел
	-- рога
	[51722] = false, -- Долой оружие
	[57934] = false, -- Маленькие хитрости

	-- дк
	[49016] = false, -- Истерия
    [47528] =false, -- сбить каст
    [47476] =false, -- [Удушение]
    [49005] =false, -- [Кровавая метка]

	-- вар
	[676] = false, -- Disarm
    [6552] =false, -- [Зуботычина]
    [3411] =false, -- [Вмешательство]
    
    -- маг 
    [2139] =false, -- [Антимагия]
    [475] =false, -- [Снятие проклятия]



	--друид 
	[29166] = false, --Озарение
    [48477] = true, -- br

	[71726] = false, -- укус вампира
	[71729] = false, -- укус вампира
	[71727] = false, -- укус вампира
	[71728] = false, -- укус вампира
    [71475] = false, -- укус вампира
    [71476] = false, -- укус вампира
	[71477] = false, -- укус вампира
	[70946] = false, -- укус вампира
}


ns.taunts = {
    -- дк
	[56222] = false, -- темная власть дк
	[49560] = false, -- хватка смерти дк
	[49576] = false, -- хватка смерти

    --вар
    [12809] =false, -- [Оглушающий удар]
	[355] = false, -- Провокация вар
	[694] = false, -- Дразнящий удар вар
    [1161] = false, -- [Вызывающий крик] -- таунт
    [6552] =false, -- [Зуботычина]

    -- пал
    [62124] = false, -- 	Длань возмездия пал
	[31790] = false, -- Праведная защита пал
    [31789] =false, -- [Праведная защита] каст
    [20066] =false, -- [Покаяние]
    [70940] =false, -- [Божественный страж]
    [10308] =false, -- [Молот правосудия]

    -- дру
    [6795] = false, -- [Рык]
    [5209] = false, -- [Вызывающий рев]
    [53227] =false, -- [Тайфун]

    -- хант
    [20736] = false, -- [Отвлекающий выстрел]

    [20736] = false, -- [Отвлекающий выстрел]

    [20233] = false,
    [20236] = false,
    [10278] = false,
}


ns.bots= {
	[22700] = true,
	[44389] = true,
	[67826] = true,
	[54710] = true,
	[54711] = true,
	[54861] = true,
}

-- использование на себя
ns.use = {
    [72148] = false, -- Исступление на шарке 25 героик
    [28747] = false, -- Бешенство на шарке 25 героик
    [48982] = false,
	-- ДК
	[48707] = false,	-- Антимагический панцирь
	[48792] = false,	-- Незыблемость льда
	[55233] = false,	-- Кровь вампира
    [42650] = false,   -- бомжи
    [48743] =false, -- [Смертельный союз]

	-- Друид
	[22812] = false,	-- Дубовая кожа
	--[22842] = false,	-- Неистовое восстановление
	[61336] = false,	-- Инстинкты выживания
	-- Паладин
	[498] 	= false, -- Диван
    [48817] = false, -- [Гнев небес]
    [64205] = true, -- масс сакра
	[31821] = false, -- Мастер аур
    [54428] = false, -- святая клятва
	-- Воин
	[12975] = false,	-- Ни шагу назад
	[12976] = false,	-- ни шагу назад спадение
	[871] 	= false,	-- глухая оборона
    [5246] = false, -- фир
    [2565] =false, -- [Блок щитом]
	-- Маг
	[45438] = false, -- Ледяная глыба
	-- Trinkets 
	[71638] = false, -- Клык
	-- Priest
	[64843] = false, -- Божественный гимн
    [64901] =false, -- [Гимн надежды]
    -- Чмо
    [31224] =false, -- [Плащ Теней]

    -- хант
    [13809] =false, -- [Ледяная ловушка]
    [34600] =false, -- [Змеиная ловушка]
    [23989] =false, -- [Готовность]

    -- шама
    [2825] =false, -- [Жажда крови]
    [32182] =false, -- gera
    [21169] =false, -- [Перерождение]
    [16190] =false, -- [Тотем прилива маны]


  
}

-- бонусы от комплектов
ns.bonus = {
	-- ДК
	[70654] = false, -- [4P T10]
	-- Друид
	[70725] = false, -- [4P T10]

    --маг
    [66] =false, -- [Невидимость]

    -- пал 
    [642] =false, -- бабл

      -- Шарк в цлк
      [72148] = false, -- Исступление на шарке 25 героик
      [28747] = false, -- Бешенство на шарке 25 героик
}

-- Еда
ns.feasts = {
	[57426] = false, -- Рыбный пир
	[57301] = false, -- "Пир на весь мир"
	[66476] = false, -- Богатый пир
}

-- плюшки на весь рейд

--  порталы магов
ns.port = {
	[53142] = false, -- Даларан
	[11419] = false, -- Дарнас
	[32266] = false, -- Экзодар
	[11416] = false, -- Стальгорн 
	[11417] = false, -- Огри 
	[33691] = false, -- Шатрат    
	[35717] = false, -- Шатрат  
	[32267] = false, -- Луносвет  
	[49361] = false, -- Каменор     
	[10059] = false, -- Шторм    
	[49360] = false, -- Терамор     
	[11420] = false, -- Громовой утес
	[11418] = false, -- Подгород   
}

ns.reborn = {
    [48153]=true, -- ангел у жреца  
    [66233]=true, -- прокладка у пала 
    [66235]=true, -- прокладка у пала
}





ns.spellsNew1 = {
    DEATHKNIGHT = {
        [56222] =false, -- [Темная власть]
        [55233] =false, -- [Кровь вампира]
        [42650] =false, -- [Войско мертвых]
        [48792] =false, -- [Незыблемость льда]
        [48982] =false, -- [Захват рун]
        [70654] =false, -- [Кровавый доспех]
        [47528] =false, -- [Заморозка разума]
        [48707] =false, -- [Антимагический панцирь]
        [49560] =false, -- [Хватка смерти]
        [49576] =false, -- [Хватка смерти] сам каст
        --[51271] =false, -- [Несокрушимая броня]
        [48743] =false, -- [Смертельный союз]
        [49016] =false, -- [Истерия]
        [47476] =false, -- [Удушение]
        [49005] =false, -- [Кровавая метка]
    },
    DRUID = {
        [61336] =false, -- [Инстинкты выживания]
        [22812] =false, -- [Дубовая кожа]
        --[20484] =false,  -- бр 
        [48477] =false, -- [Возрождение]
       -- [48447] =false, -- [Спокойствие]
        [53227] =false, -- [Тайфун]
        --[8983] =false, -- [Оглушить]
        [6795] =false, -- [Рык]
        [5209] =false, -- [Вызывающий рев]
        [29166] =false, -- [Озарение]
        [70725] =false, -- [4P T10]
    },
    HUNTER = {
        [34477] =false, -- [Перенаправление]
        [13809] =false, -- [Ледяная ловушка]
       -- [23989] =false, -- [Готовность]
        [19801] =false, -- [Усмиряющий выстрел]
        [20736] =false, -- [Отвлекающий выстрел]
        [34600] =false, -- [Змеиная ловушка]
    },
    MAGE = {
        [66] =false, -- [Невидимость]
      --  [31687] =false, -- [Призыв элементаля воды]
        [45438] =false, -- [Ледяная глыба]
        [475] =false, -- [Снятие проклятия]
        [2139] =false, -- [Антимагия]
        [58659] =false, -- [Стол]
    },
    PALADIN = {
        [31790] =false, -- Праведная защита пал
        [62124] =false, -- [Длань возмездия]
    
        [1044] =false, -- [Длань свободы]
        [1038] =false, -- [Длань спасения]
        [6940] =false, -- [Длань жертвенности]
        [10278] =false, -- [Длань защиты]
        
        [20066] =false, -- [Покаяние]
    
        [48817] =false, -- [Гнев небес]
        [10308] =false, -- [Молот правосудия]
        
        -- [31850] =false, -- Ревностный защитник
        [66233] =false, -- [Ревностный защитник]
        [66235] =false, -- [Ревностный защитник]
        
        [31789] =false, -- [Праведная защита] каст
        [31821] =false, -- [Мастер аур]
        --[31884] =false, -- крылья
        --[53601] =false, -- [Священный щит]
        [498] =false, -- 50 на 50
        
        [642] =false, -- бабл
    
        --[70940] =false, -- [Божественный страж] эфект от масс сакры на рейде 
        [64205] =false, -- масс сакра
        --[31842] =false, -- [Божественное просветление]
    
        [19752] =false, -- диван
        
        [54428] =false, -- [Святая клятва]
        -- [48788] =false, -- [Возложение рук]
        [20233] =false, -- Возложение рук
        [20236] =false, -- Возложение рук
    },
    PRIEST = {
        [48153] =false, -- [Оберегающий дух]
        [47788] =false, -- [Оберегающий дух]
        [6346] =false, -- [Защита от страха]
        [33206] =false, -- [Подавление боли]
    
        [64901] =false, -- [Гимн надежды]
        [64843] =false, -- [Божественный гимн]
        
        -- [8122] =false, -- [Ментальный крик]
        -- [15487] =false, -- [Безмолвие]
        -- [34433] =false, -- [Исчадие Тьмы]
        -- [724] =false, -- [Колодец Света]
        -- [64044] =false, -- [Глубинный ужас]
        -- [10890] =false, -- [Ментальный крик]
    
        -- [586] =false, -- [Уход в тень]
    
        -- [10060] =false, -- [Придание сил]
    
        -- [47585] =false, -- [Слияние с Тьмой]
        -- [48113] =false, -- [Молитва восстановления]
    },
    ROGUE = {
        [51722] =false, -- [Долой оружие]
        [57934] =false, -- [Маленькие хитрости]
            
        -- [26669] =false, -- [Ускользание]
        -- [13877] =false, -- [Шквал клинков]
        -- [48659] =false, -- [Ложный выпад]
        -- [1856] =false, -- [Исчезновение]
        -- [11305] =false, -- [Спринт]
        -- [26889] =false, -- [Исчезновение]
        -- [1766] =false, -- [Пинок]
        -- [5277] =false, -- [Ускользание]
        -- [2094] =false, -- [Ослепление]
        -- [13750] =false, -- [Выброс адреналина]
        -- [8643] =false, -- [Удар по почкам]
        -- [14185] =false, -- [Подготовка]
        -- [51690] =false, -- [Череда убийств]
        [31224] =false, -- [Плащ Теней]
        --[1725] =false, -- [Отвлечение]
    },
    SHAMAN = {
        [2825] =false, -- [Жажда крови]
        [32182] =false, -- [Героизм]
        [16190] =false, -- [Тотем прилива маны]
        [21169] =false, -- [Перерождение]
    
        -- [16188] =false, -- [Природная стремительность]
        -- [51533] =false, -- [Дух дикого волка]
        -- [16166] =false, -- [Покорение стихий]
        -- [57994] =false, -- [Пронизывающий ветер]
        -- [30823] =false, -- [Ярость шамана]
        -- [59159] =false, -- [Гром и молния]
    
        -- [51514] =false, -- [Сглаз]
        -- [20608] =false, -- [Перерождение]
        -- [2894] =false, -- [Тотем элементаля огня]
        -- [2062] =false, -- [Тотем элементаля земли]
    },
    WARLOCK = {
        [58887] =false, -- Ритуал душ
        [698]	=false,	-- Ритуал призыва
    
        -- [47241] =false, -- [Метаморфоза]
        -- [1122] =false, -- [Инфернал]
        -- [18540] =false, -- [Ритуал Рока]
        -- [29858] =false, -- [Раскол души]
        -- [47883] =false, -- [Воскрешение камнем души]
        -- [47891] =false, -- [Заслон от темной магии]
        -- [29893] =false, -- [Ритуал душ]
        -- [698] =false, -- [Ритуал призыва]
        -- [6203] =false, -- [Камень души]
    },
    WARRIOR = {
    
        [355] =false, -- [Провокация]
        [694] =false, -- [дразнящий удар]
        [1161] =false, -- [Вызывающий крик] -- таунт
    
        [6552] =false, -- [Зуботычина]
        
        [676] =false, -- [Разоружение]
    
        --[55694] =false, -- [Безудержное восстановление]
        [12809] =false, -- [Оглушающий удар]
        [3411] =false, -- [Вмешательство]
        [12975] =false, -- [Ни шагу назад]
        [12976] =false, -- [Ни шагу назад]
        [871] =false, -- [Глухая оборона]
        [70845] =false, -- [Стоицизм] т10
    
        [2565] =false, -- [Блок щитом]
      --  [12323] =false, -- [Пронзительный вой]
    
        [5246] =false, -- устрашающий-крик
    },
    Engineering = {
            -- инженерка 
        [54861] =false,
        [22700] =false,
        [44389] =false,
        [67826] =false,
        [54710] =false,
        [54711] =false,
    },
    Accessories ={
            -- Trinkets 
        [71638] =false, -- Клык
    },
    MagicPortals = {
        [53142] =false, -- Даларан
        [11419] =false, -- Дарнас
        [32266] =false, -- Экзодар
        [11416] =false, -- Стальгорн 
        [11417] =false, -- Огри 
        [33691] =false, -- Шатрат    
        [35717] =false, -- Шатрат  
        [32267] =false, -- Луносвет  
        [49361] =false, -- Каменор     
        [10059] =false, -- Шторм    
        [49360] =false, -- Терамор     
        [11420] =false, -- Громовой утес
        [11418] =false, -- Подгород   
    },
    Food ={

        --eda
        [57426] =false, -- Рыбный пир
        [57301] =false, -- "Пир на весь мир"
        [66476] =false, -- Богатый пир
    },
    ICC25HM ={
        [74320] = false, -- жнец душ
        [73797] = false, -- жнец душ
        [73798] = false, -- жнец душ
        [73799] = false, -- жнец душ
        [71726] = false, -- укус вампира
        [71729] = false, -- укус вампира
        [71727] = false, -- укус вампира
        [71728] = false, -- укус вампира
        [71475] = false, -- укус вампира
        [71476] = false, -- укус вампира
        [71477] = false, -- укус вампира
        [70946] = false, -- укус вампира
        [72148] = false, -- Исступление на шарке 25 героик
        [28747] = false, -- Бешенство на шарке 25 героик

    },  
}