local AddOnName, ns = ...;

local SPELL_AURA_APPLIED = "SPELL_AURA_APPLIED"
local SPELL_CAST_SUCCESS = "SPELL_CAST_SUCCESS"
local SPELL_CAST_START = "SPELL_CAST_START"
local SPELL_CREATE = "SPELL_CREATE"
local SPELL_RESURRECT = "SPELL_RESURRECT"
local SPELL_AURA_REMOVED = "SPELL_AURA_REMOVED"
local UNIT_DIED = "UNIT_DIED"; 
local SPELL_DISPEL_FAILED = "SPELL_DISPEL_FAILED"
local SPELL_HEAL = "SPELL_HEAL"
local SPELL_MISSED = "SPELL_MISSED"
local SPELL_DAMAGE ="SPELL_DAMAGE"
local SPELL_PERIODIC_HEAL="SPELL_PERIODIC_HEAL"
local SPELL_DISPEL="SPELL_DISPEL"
local SPELL_DISPEL_FAILED = "SPELL_DISPEL_FAILED"

ns.data2 = {}
ns.data2 = {
    ------------------------------------------------------------------------------------------
    ------------------------------DEATHKNIGHT------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------56222------------------------------
    {92590,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0xF130008F5D000B5C,"Гневный дух",0xa28,56222,"Темная власть",0x1},
    {92594,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0xF130008F5D000B5C,"Гневный дух",0xa28,56222,"Темная власть",0x1,DEBUFF},
    {206706,SPELL_CAST_SUCCESS,0x00000000006E9F12,"Asitab",0x528,0xF1500093B500000B,"Саурфанг Смертоносный",0xa28,56222,"Темная власть",0x1},
    {206717,SPELL_MISSED,0x00000000006E9F12,"Asitab",0x528,0xF1500093B500000B,"Саурфанг Смертоносный",0xa28,56222,"Темная власть",0x1,DEBUFF},

    ------------------------------55233------------------------------
    {47820,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,55233,"Кровь вампира",0x1},
    {47829,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,55233,"Кровь вампира",0x1,BUFF},
    {375461,SPELL_CAST_SUCCESS,0x00000000006E9F12,"Asitab",0x528,0x0000000000000000,nil,0x80000000,55233,"Кровь вампира",0x1},
    {375490,SPELL_AURA_APPLIED,0x00000000006E9F12,"Asitab",0x528,0x00000000006E9F12,"Asitab",0x528,55233,"Кровь вампира",0x1,BUFF},
    {379377,SPELL_AURA_REMOVED,0x00000000006E9F12,"Asitab",0x528,0x00000000006E9F12,"Asitab",0x528,55233,"Кровь вампира",0x1,BUFF},

    ------------------------------42650------------------------------
    {60166,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,42650,"Войско мертвых",0x20},
    {60167,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,42650,"Войско мертвых",0x20,BUFF},
    {60543,SPELL_AURA_REMOVED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,42650,"Войско мертвых",0x20,BUFF},
    {408448,SPELL_CAST_SUCCESS,0x000000000047CC7F,"Аббадонт",0x528,0x0000000000000000,nil,0x80000000,42650,"Войско мертвых",0x20},
    {408450,SPELL_AURA_APPLIED,0x000000000047CC7F,"Аббадонт",0x528,0x000000000047CC7F,"Аббадонт",0x528,42650,"Войско мертвых",0x20,BUFF},
    {409617,SPELL_AURA_REMOVED,0x000000000047CC7F,"Аббадонт",0x528,0x000000000047CC7F,"Аббадонт",0x528,42650,"Войско мертвых",0x20,BUFF},

    ------------------------------48792------------------------------
    {37262,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,48792,"Незыблемость льда",0x1},
    {37305,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,48792,"Незыблемость льда",0x1,BUFF},
    {187547,SPELL_AURA_APPLIED,0x00000000003B8FC0,"Hvswtf",0x528,0x00000000003B8FC0,"Hvswtf",0x528,48792,"Незыблемость льда",0x1,BUFF},
    {188342,SPELL_AURA_REMOVED,0x00000000003B8FC0,"Hvswtf",0x528,0x00000000003B8FC0,"Hvswtf",0x528,48792,"Незыблемость льда",0x1,BUFF},

    ------------------------------48982------------------------------
    {48283,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,48982,"Захват рун",0x20},
    {48284,SPELL_HEAL,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,48982,"Захват рун",0x20,39601,10569,0,nil},
    {187109,SPELL_HEAL,0x00000000003B8FC0,"Hvswtf",0x528,0x00000000003B8FC0,"Hvswtf",0x528,48982,"Захват рун",0x20,19809,0,0,nil},
    {242365,SPELL_CAST_SUCCESS,0x00000000006E9F12,"Asitab",0x528,0x0000000000000000,nil,0x80000000,48982,"Захват рун",0x20},

    ------------------------------70654------------------------------
    {2139,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,70654,"Кровавый доспех",0x20,BUFF},
    {4470,SPELL_AURA_REMOVED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,70654,"Кровавый доспех",0x20,BUFF},
    {161738,SPELL_AURA_REMOVED,0x000000000030BF0B,"Azog",0x528,0x000000000030BF0B,"Azog",0x528,70654,"Кровавый доспех",0x20,BUFF},

    ------------------------------47528------------------------------
    {292486,SPELL_CAST_SUCCESS,0x00000000005BEF6D,"Robkill",0x528,0xF1300093EC0002DE,"Воскрешенный верховный маг",0xa28,47528,"Заморозка разума",0x10},
    {292487,SPELL_INTERRUPT,0x00000000005BEF6D,"Robkill",0x528,0xF1300093EC0002DE,"Воскрешенный верховный маг",0xa28,47528,"Заморозка разума",0x10,71889,"Залп ледяных стрел",16},
    {805036,SPELL_INTERRUPT,0x0000000000670D93,"Поррешка",0x528,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,47528,"Заморозка разума",0x10,72502,"Ледяная стрела",16},
    {808596,SPELL_CAST_SUCCESS,0x0000000000670D93,"Поррешка",0x528,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,47528,"Заморозка разума",0x10},

    ------------------------------48707------------------------------
    {7191,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,48707,"Антимагический панцирь",0x20},
    {7205,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,48707,"Антимагический панцирь",0x20,BUFF},
    {153936,SPELL_AURA_APPLIED,0x000000000030BF0B,"Azog",0x528,0x000000000030BF0B,"Azog",0x528,48707,"Антимагический панцирь",0x20,BUFF},
    {154507,SPELL_AURA_REMOVED,0x000000000030BF0B,"Azog",0x528,0x000000000030BF0B,"Azog",0x528,48707,"Антимагический панцирь",0x20,BUFF},

    ------------------------------49560------------------------------
    {213306,SPELL_AURA_APPLIED,0x00000000006E9F12,"Asitab",0x528,0xF13000960A000243,"Страждущая душа",0xa28,49560,"Хватка смерти",0x1,DEBUFF},
    {213656,SPELL_AURA_REMOVED,0x00000000006E9F12,"Asitab",0x528,0xF13000960A000243,"Страждущая душа",0xa28,49560,"Хватка смерти",0x1,DEBUFF},
    {309516,SPELL_AURA_REMOVED,0x00000000006E9F12,"Asitab",0x528,0xF13000916D00033B,"Колдунья Служителей Льда",0xa28,49560,"Хватка смерти",0x1,DEBUFF},
    {399582,SPELL_AURA_APPLIED,0x000000000047CC7F,"Аббадонт",0x528,0xF13000966C000277,"Кровавое чудовище",0xa28,49560,"Хватка смерти",0x1,DEBUFF},

    ------------------------------49576------------------------------
    {62100,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0xF130008EF5000B1C,"Король-лич",0xa28,49576,"Хватка смерти",0x1},
    {62101,SPELL_MISSED,0x00000000003028B1,"Хербородатый",0x528,0xF130008EF5000B1C,"Король-лич",0xa28,49576,"Хватка смерти",0x1,IMMUNE},
    {87848,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0xF130008F5D000B54,"Гневный дух",0xa28,49576,"Хватка смерти",0x1},
    {262460,SPELL_CAST_SUCCESS,0x00000000006E9F12,"Asitab",0x528,0xF13000910E000160,"Имирьярская охотница",0xa28,49576,"Хватка смерти",0x1},

    ------------------------------48743------------------------------
    {55205,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,48743,"Смертельный союз",0x20},
    {55206,SPELL_HEAL,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,48743,"Смертельный союз",0x20,44634,44634,0,nil},
    {55207,SPELL_INSTAKILL,0x00000000003028B1,"Хербородатый",0x528,0xF13000660D000B0F,"Восставший вурдалак",0x1128,48743,"Смертельный союз",0x20},
    {3356579,SPELL_INSTAKILL,0x00000000007D3E96,"Штольцдрагон",0x528,0xF13000660D000DDC,"Восставший вурдалак",0x1128,48743,"Смертельный союз",0x20},

    ------------------------------49016------------------------------
    {3866,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000863D2D,"Fuliker",0x528,49016,"Истерия",0x1},
    {3884,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x0000000000863D2D,"Fuliker",0x528,49016,"Истерия",0x1,BUFF},
    {9840,SPELL_AURA_REMOVED,0x00000000003028B1,"Хербородатый",0x528,0x0000000000863D2D,"Fuliker",0x528,49016,"Истерия",0x1,BUFF},
    {379582,SPELL_AURA_REMOVED,0x00000000007A23A0,"Ветерипыль",0x528,0x0000000000863F63,"Amcat",0x528,49016,"Истерия",0x1,BUFF},

    ------------------------------47476------------------------------
    {604576,SPELL_CAST_SUCCESS,0x00000000000538CD,"Charmingg",0x528,0xF13000909F00030F,"Исследователь чумы",0xa28,47476,"Удушение",0x20},
    {1595496,SPELL_AURA_APPLIED,0x000000000084EF73,"Мгс",0x528,0xF1300093220003E3,"Омраченный тактик",0xa28,47476,"Удушение",0x20,DEBUFF},
    {1597031,SPELL_AURA_REMOVED,0x000000000084EF73,"Мгс",0x528,0xF1300093220003E3,"Омраченный тактик",0xa28,47476,"Удушение",0x20,DEBUFF},
    {2606579,SPELL_CAST_SUCCESS,0x0000000000862F62,"Пухлыйдк",0x528,0xF13000943D00017E,"Приверженец культа",0xa28,47476,"Удушение",0x20},

    ------------------------------49005------------------------------
    {56774,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0xF130008FF5000700,"Синдрагоса",0xa28,49005,"Кровавая метка",0x20},
    {56779,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0xF130008FF5000700,"Синдрагоса",0xa28,49005,"Кровавая метка",0x20,DEBUFF},
    {57083,SPELL_AURA_REMOVED,0x00000000003028B1,"Хербородатый",0x528,0xF130008FF5000700,"Синдрагоса",0xa28,49005,"Кровавая метка",0x20,DEBUFF},
    {2182196,SPELL_CAST_SUCCESS,0x00000000006A64DB,"Poofpoofqq",0x528,0xF130008EF50007EE,"Король-лич",0xa28,49005,"Кровавая метка",0x20},
    ------------------------------------------------------------------------------------------
    ------------------------------DRUID------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------61336------------------------------
    {160171,SPELL_CAST_SUCCESS,0x00000000003DF682,"Ustritsa",0x528,0x0000000000000000,nil,0x80000000,61336,"Инстинкты выживания",0x1},
    {2643496,SPELL_CAST_SUCCESS,0x00000000007CE89D,"Protoplazsm",0x528,0x0000000000000000,nil,0x80000000,61336,"Инстинкты выживания",0x1},
    {2643516,SPELL_AURA_APPLIED,0x00000000007CE89D,"Protoplazsm",0x528,0x00000000007CE89D,"Protoplazsm",0x528,61336,"Инстинкты выживания",0x1,BUFF},
    {2647719,SPELL_AURA_REMOVED,0x00000000007CE89D,"Protoplazsm",0x528,0x00000000007CE89D,"Protoplazsm",0x528,61336,"Инстинкты выживания",0x1,BUFF},

    ------------------------------22812------------------------------
    {21903,SPELL_CAST_SUCCESS,0x0000000000867A06,"Holisherb",0x528,0x0000000000000000,nil,0x80000000,22812,"Дубовая кожа",0x8},
    {21918,SPELL_AURA_APPLIED,0x0000000000867A06,"Holisherb",0x528,0x0000000000867A06,"Holisherb",0x528,22812,"Дубовая кожа",0x8,BUFF},
    {143771,SPELL_AURA_REMOVED,0x00000000003DF682,"Ustritsa",0x528,0x00000000003DF682,"Ustritsa",0x528,22812,"Дубовая кожа",0x8,BUFF},
    {159899,SPELL_CAST_SUCCESS,0x00000000003DF682,"Ustritsa",0x528,0x0000000000000000,nil,0x80000000,22812,"Дубовая кожа",0x8},

    ------------------------------48477------------------------------
    {178073,SPELL_CAST_START,0x00000000006B05EA,"Arzdg",0x528,0x0000000000000000,nil,0x80000000,48477,"Возрождение",0x8},
    {178261,SPELL_RESURRECT,0x00000000006B05EA,"Arzdg",0x528,0x000000000083CD8B,"Ультраслива",0x528,48477,"Возрождение",0x8},
    {558607,SPELL_RESURRECT,0x00000000006057CA,"Gachiremix",0x528,0x00000000007D15A1,"Teisoheal",0x528,48477,"Возрождение",0x8},
    {742467,SPELL_CAST_START,0x000000000086600B,"Blloodborn",0x528,0x0000000000000000,nil,0x80000000,48477,"Возрождение",0x8},

    ------------------------------53227------------------------------
    {817950,SPELL_DAMAGE,0x000000000075F816,"Масилия",0x1228,0x00000000007934FE,"Dichtop",0x528,53227,"Тайфун",0x8,15538,0,8,0,0,0,1,nil,nil},
    {817952,SPELL_DAMAGE,0x000000000075F816,"Масилия",0x1228,0x00000000000DCB00,"Frostvorg",0x528,53227,"Тайфун",0x8,7335,0,8,0,0,1449,nil,nil,nil},
    {1432507,SPELL_DAMAGE,0x0000000000658701,"Madmoney",0x528,0xF130009341000604,"Неустойчивый слизнюк",0xa28,53227,"Тайфун",0x8,5884,0,8,0,0,0,1,nil,nil},
    {1691691,SPELL_DAMAGE,0x0000000000658701,"Madmoney",0x528,0xF13000910E00033C,"Имирьярская охотница",0xa28,53227,"Тайфун",0x8,5521,0,8,0,0,0,1,nil,nil},
    ------------------------------33786------------------------------
    {nil,SPELL_AURA_APPLIED,0x000000000017191F,"Dearross",0x528,0x0000000000827CE5,"Дивайна",0x1228,33786,"Смерч",0x8,DEBUFF},
    {nil,SPELL_CAST_START,0x000000000083C4EF,"Колобчело",0x528,0x0000000000000000,nil,0x80000000,33786,"Смерч",0x8},
    {nil,SPELL_AURA_APPLIED,0x00000000004E88DE,"Леньер",0x528,0x000000000017191F,"Dearross",0x1228,33786,"Смерч",0x8,DEBUFF},
    {nil,SPELL_AURA_REMOVED,0x000000000083C4EF,"Колобчело",0x528,0x00000000006EDB80,"Ростаманка",0x1228,33786,"Смерч",0x8,DEBUFF},
    {nil,SPELL_CAST_START,0x000000000083C4EF,"Колобчело",0x528,0x0000000000000000,nil,0x80000000,33786,"Смерч",0x8},
    ------------------------------6795------------------------------
    {137498,SPELL_CAST_SUCCESS,0x00000000003DF682,"Ustritsa",0x528,0xF13000929E000277,"Хребтохруст",0x10a28,6795,"Рык",0x1},
    {137499,SPELL_AURA_APPLIED,0x00000000003DF682,"Ustritsa",0x528,0xF13000929E000277,"Хребтохруст",0x10a28,6795,"Рык",0x1,DEBUFF},
    {172175,SPELL_CAST_SUCCESS,0x00000000003DF682,"Ustritsa",0x528,0xF1300093420006D3,"Шаркающий ужас",0xa28,6795,"Рык",0x1},
    {174904,SPELL_AURA_APPLIED,0x00000000003DF682,"Ustritsa",0x528,0xF13000933F0006D6,"Вурдалак-приспешник",0xa28,6795,"Рык",0x1,DEBUFF},

    ------------------------------5209------------------------------
    {254869,SPELL_CAST_SUCCESS,0x00000000008673D3,"Котобродолёт",0x528,0x0000000000000000,nil,0x80000000,5209,"Вызывающий рев",0x1},
    {254871,SPELL_AURA_APPLIED,0x00000000008673D3,"Котобродолёт",0x528,0xF130009528000275,"Зараженный имирьяр",0xa28,5209,"Вызывающий рев",0x1,DEBUFF},
    {254872,SPELL_AURA_APPLIED,0x00000000008673D3,"Котобродолёт",0x528,0xF130009528000274,"Зараженный имирьяр",0xa28,5209,"Вызывающий рев",0x1,DEBUFF},
    ------------------------------29166------------------------------
    {89342,SPELL_CAST_SUCCESS,0x000000000086AED3,"Папашасына",0x528,0x0000000000867E95,"Voinkom",0x528,29166,"Озарение",0x8},
    {89358,SPELL_AURA_APPLIED,0x000000000086AED3,"Папашасына",0x528,0x0000000000867E95,"Voinkom",0x528,29166,"Озарение",0x8,BUFF},
    {89580,SPELL_CAST_SUCCESS,0x0000000000867A06,"Holisherb",0x528,0x0000000000867A06,"Holisherb",0x528,29166,"Озарение",0x8},
    {89600,SPELL_AURA_APPLIED,0x0000000000867A06,"Holisherb",0x528,0x0000000000867A06,"Holisherb",0x528,29166,"Озарение",0x8,BUFF},

    ------------------------------70725------------------------------
    {127811,SPELL_AURA_APPLIED,0x00000000003DF682,"Ustritsa",0x528,0x00000000003DF682,"Ustritsa",0x528,70725,"Яростная защита",0x20,BUFF},
    {128817,SPELL_AURA_APPLIED,0x00000000003DF682,"Ustritsa",0x528,0x00000000003DF682,"Ustritsa",0x528,70725,"Яростная защита",0x20,BUFF},
    {2618583,SPELL_AURA_APPLIED,0x00000000007CE89D,"Protoplazsm",0x528,0x00000000007CE89D,"Protoplazsm",0x528,70725,"Яростная защита",0x20,BUFF},
    ------------------------------------------------------------------------------------------
    ------------------------------HUNTER------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------34477------------------------------
    {113,SPELL_CAST_SUCCESS,0x0000000000864A81,"Бевполезный",0x528,0x00000000003028B1,"Хербородатый",0x528,34477,"Перенаправление",0x1},
    {153,SPELL_AURA_APPLIED,0x0000000000864A81,"Бевполезный",0x528,0x0000000000864A81,"Бевполезный",0x528,34477,"Перенаправление",0x1,BUFF},
    {222806,SPELL_CAST_SUCCESS,0x0000000000580B42,"Lovkiytroll",0x528,0x00000000006E9F12,"Asitab",0x528,34477,"Перенаправление",0x1},
    {222807,SPELL_AURA_APPLIED,0x0000000000580B42,"Lovkiytroll",0x528,0x0000000000580B42,"Lovkiytroll",0x528,34477,"Перенаправление",0x1,BUFF},

    ------------------------------13809------------------------------
    {102065,SPELL_CAST_SUCCESS,0x0000000000864A81,"Бевполезный",0x528,0x0000000000000000,nil,0x80000000,13809,"Ледяная ловушка",0x10},
    {102066,SPELL_CREATE,0x0000000000864A81,"Бевполезный",0x528,0xF11002831F00020E,"Ледяная ловушка",0x4228,13809,"Ледяная ловушка",0x10},
    {317957,SPELL_CREATE,0x000000000080411D,"Nastasya",0x528,0xF11002831F00008F,"Ледяная ловушка",0x4228,13809,"Ледяная ловушка",0x10},
    {1516913,SPELL_CAST_SUCCESS,0x00000000007D24A5,"Playboymodel",0x528,0x0000000000000000,nil,0x80000000,13809,"Ледяная ловушка",0x10},

    ------------------------------23989------------------------------
    {39807,SPELL_CAST_SUCCESS,0x00000000007C4C19,"Maiasel",0x528,0x0000000000000000,nil,0x80000000,23989,"Готовность",0x1},
    {181870,SPELL_CAST_SUCCESS,0x0000000000863067,"Gatuza",0x528,0x0000000000000000,nil,0x80000000,23989,"Готовность",0x1},
    {1447639,SPELL_CAST_SUCCESS,0x00000000007D24A5,"Playboymodel",0x528,0x0000000000000000,nil,0x80000000,23989,"Готовность",0x1},

    ------------------------------19801------------------------------
    {71103,SPELL_CAST_SUCCESS,0x00000000007C4C19,"Maiasel",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8},
    {71252,SPELL_DISPEL,0x00000000007C4C19,"Maiasel",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72146,"Исступление",1,BUFF},
    {1910404,SPELL_CAST_SUCCESS,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000961,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8},
    {1910628,SPELL_DISPEL,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000961,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},

    ------------------------------20736------------------------------
    {1490428,SPELL_CAST_SUCCESS,0x00000000007D24A5,"Playboymodel",0x528,0xF13000934100067C,"Неустойчивый слизнюк",0xa28,20736,"Отвлекающий выстрел",0x40},
    {1490675,SPELL_MISSED,0x00000000007D24A5,"Playboymodel",0x528,0xF13000934100067C,"Неустойчивый слизнюк",0xa28,20736,"Отвлекающий выстрел",0x40,IMMUNE},
    {2386383,SPELL_CAST_SUCCESS,0x00000000007658C6,"Soodaa",0x528,0xF130009EE900015F,"Живое адское пламя",0xa28,20736,"Отвлекающий выстрел",0x40},

    ------------------------------34600------------------------------
    {102150,SPELL_CAST_SUCCESS,0x00000000007C4C19,"Maiasel",0x528,0x0000000000000000,nil,0x80000000,34600,"Змеиная ловушка",0x4},
    {102151,SPELL_CREATE,0x00000000007C4C19,"Maiasel",0x528,0xF11002CE9500020F,"Змеиная ловушка",0x4228,34600,"Змеиная ловушка",0x4},
    {1493038,SPELL_CREATE,0x00000000007D24A5,"Playboymodel",0x528,0xF11002CE950000FB,"Змеиная ловушка",0x4228,34600,"Змеиная ловушка",0x4},
    {1879223,SPELL_CAST_SUCCESS,0x0000000000814487,"Lemyp",0x528,0x0000000000000000,nil,0x80000000,34600,"Змеиная ловушка",0x4},
    ------------------------------------------------------------------------------------------
    ------------------------------MAGE------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------66------------------------------
    {833540,SPELL_CAST_SUCCESS,0x0000000000793555,"Poterpevshiu",0x528,0x0000000000000000,nil,0x80000000,66,"Невидимость",0x40},
    {833559,SPELL_AURA_APPLIED,0x0000000000793555,"Poterpevshiu",0x528,0x0000000000793555,"Poterpevshiu",0x528,66,"Невидимость",0x40,BUFF},
    {2180852,SPELL_AURA_REMOVED,0x000000000070DCFF,"Файрхард",0x528,0x000000000070DCFF,"Файрхард",0x528,66,"Невидимость",0x40,BUFF},

    ------------------------------45438------------------------------
    {227685,SPELL_CAST_SUCCESS,0x000000000086CAE1,"Debannj",0x528,0x0000000000000000,nil,0x80000000,45438,"Ледяная глыба",0x10},
    {227731,SPELL_AURA_APPLIED,0x000000000086CAE1,"Debannj",0x528,0x000000000086CAE1,"Debannj",0x528,45438,"Ледяная глыба",0x10,BUFF},
    {743692,SPELL_CAST_SUCCESS,0x00000000007CD228,"Noxsiik",0x528,0x0000000000000000,nil,0x80000000,45438,"Ледяная глыба",0x10},
    {743716,SPELL_AURA_APPLIED,0x00000000007CD228,"Noxsiik",0x528,0x00000000007CD228,"Noxsiik",0x528,45438,"Ледяная глыба",0x10,BUFF},
    ------------------------------475------------------------------
    {2475800,SPELL_CAST_SUCCESS,0x000000000015744C,"Аленадавай",0x528,0x000000000015744C,"Аленадавай",0x528,475,"Снятие проклятия",0x40},
    {2475804,SPELL_DISPEL,0x000000000015744C,"Аленадавай",0x528,0x000000000015744C,"Аленадавай",0x528,475,"Снятие проклятия",0x40,74795,"Метка пожирания",32,BUFF},
    {2661371,SPELL_CAST_SUCCESS,0x0000000000312B81,"Frostyk",0x528,0x00000000007FF0CD,"Getreixs",0x528,475,"Снятие проклятия",0x40},
    {2661373,SPELL_DISPEL,0x0000000000312B81,"Frostyk",0x528,0x00000000007FF0CD,"Getreixs",0x528,475,"Снятие проклятия",0x40,71237,"Проклятие оцепенения",32,BUFF},

    ------------------------------2139------------------------------
    {235945,SPELL_CAST_SUCCESS,0x000000000086CAE1,"Debannj",0x528,0xF1300094ED000186,"Имирьярский носитель смерти",0xa28,2139,"Антимагия",0x40},
    {292488,SPELL_CAST_SUCCESS,0x000000000086CAE1,"Debannj",0x528,0xF1300093EC0002DE,"Воскрешенный верховный маг",0xa28,2139,"Антимагия",0x40},
    {299089,SPELL_CAST_SUCCESS,0x000000000086CAE1,"Debannj",0x528,0xF1300093EC000308,"Воскрешенный верховный маг",0xa28,2139,"Антимагия",0x40},
    {1274897,SPELL_CAST_SUCCESS,0x000000000022F1B5,"Dipkamatee",0x528,0xF1300094ED000312,"Имирьярский носитель смерти",0xa28,2139,"Антимагия",0x40},
    {2164552,SPELL_CAST_SUCCESS,0x00000000003925B4,"Ружьёпяточка",0x528,0xF130008F5D000657,"Гневный дух",0xa28,2139,"Антимагия",0x40},

    ------------------------------58659------------------------------
    {2840565,SPELL_CAST_SUCCESS,0x0000000000312B81,"Frostyk",0x528,0x0000000000000000,nil,0x80000000,58659,"Обряд сотворения яств",0x40},
    {2840566,SPELL_CREATE,0x0000000000312B81,"Frostyk",0x528,0xF11002F226000119,"Портал стола с яствами",0x4128,58659,"Обряд сотворения яств",0x40},
    ------------------------------------------------------------------------------------------
    ------------------------------PALADIN------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------31790------------------------------
    {65230,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0xF13000933F000B47,"Вурдалак-приспешник",0xa28,31790,"Праведная защита",0x1,DEBUFF},
    {65232,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0xF13000933F000B46,"Вурдалак-приспешник",0xa28,31790,"Праведная защита",0x1,DEBUFF},
    {186244,SPELL_AURA_APPLIED,0x0000000000403B45,"Jussed",0x528,0xF13000933F00074C,"Вурдалак-приспешник",0xa28,31790,"Праведная защита",0x1,DEBUFF},

    ------------------------------62124------------------------------
    {66767,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,62124,"Длань возмездия",0x2},
    {66777,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,62124,"Длань возмездия",0x2,DEBUFF},

    ------------------------------1044------------------------------
    {9888,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x00000000003028B1,"Хербородатый",0x528,1044,"Длань свободы",0x2},
    {9902,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0x00000000003028B1,"Хербородатый",0x528,1044,"Длань свободы",0x2,BUFF},
    {355081,SPELL_AURA_APPLIED,0x0000000000724E51,"Hildryg",0x528,0x00000000007A23A0,"Ветерипыль",0x528,1044,"Длань свободы",0x2,BUFF},
    {355408,SPELL_CAST_SUCCESS,0x000000000086EAB0,"Liggma",0x528,0x00000000007A23A0,"Ветерипыль",0x528,1044,"Длань свободы",0x2},

    ------------------------------1038------------------------------
    {285,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x00000000007CEA4E,"Грустьбобра",0x528,1038,"Длань спасения",0x2},
    {1381092,SPELL_AURA_APPLIED,0x00000000005B6841,"Аргентлайт",0x528,0x00000000005B6841,"Аргентлайт",0x528,1038,"Длань спасения",0x2,BUFF},
    {1381939,SPELL_CAST_SUCCESS,0x00000000007C2886,"Merfln",0x528,0x00000000005B6841,"Аргентлайт",0x528,1038,"Длань спасения",0x2},

    ------------------------------6940------------------------------
    {47023,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x000000000035A108,"Blizlike",0x528,6940,"Длань жертвенности",0x2},
    {47031,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0x000000000035A108,"Blizlike",0x528,6940,"Длань жертвенности",0x2,BUFF},
    {58079,SPELL_CAST_SUCCESS,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000867E95,"Voinkom",0x528,6940,"Длань жертвенности",0x2},
    {58098,SPELL_AURA_APPLIED,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000867E95,"Voinkom",0x528,6940,"Длань жертвенности",0x2,BUFF},
    {160161,SPELL_CAST_SUCCESS,0x0000000000696DC5,"Быкбыковская",0x528,0x00000000001F542B,"Allesany",0x528,6940,"Длань жертвенности",0x2},
    {160162,SPELL_AURA_APPLIED,0x0000000000696DC5,"Быкбыковская",0x528,0x00000000001F542B,"Allesany",0x528,6940,"Длань жертвенности",0x2,BUFF},

    ------------------------------10278------------------------------
    {366223,SPELL_CAST_SUCCESS,0x000000000086EAB0,"Liggma",0x528,0x000000000086EAB0,"Liggma",0x528,10278,"Длань защиты",0x2},
    {366233,SPELL_AURA_APPLIED,0x000000000086EAB0,"Liggma",0x528,0x000000000086EAB0,"Liggma",0x528,10278,"Длань защиты",0x2,BUFF},
    {709700,SPELL_CAST_SUCCESS,0x000000000066E4E4,"Rolapi",0x528,0x000000000068ABF7,"Малирэйн",0x528,10278,"Длань защиты",0x2},
    {709728,SPELL_AURA_APPLIED,0x000000000066E4E4,"Rolapi",0x528,0x000000000068ABF7,"Малирэйн",0x528,10278,"Длань защиты",0x2,BUFF},

    ------------------------------20066------------------------------
    {133515,SPELL_CAST_SUCCESS,0x0000000000696DC5,"Быкбыковская",0x10528,0xF13000929B00023D,"Рабочий Служителей Льда",0xa28,20066,"Покаяние",0x2},
    {133529,SPELL_AURA_APPLIED,0x0000000000696DC5,"Быкбыковская",0x10528,0xF13000929B00023D,"Рабочий Служителей Льда",0xa28,20066,"Покаяние",0x2,DEBUFF},
    {133538,SPELL_AURA_REMOVED,0x0000000000696DC5,"Быкбыковская",0x10528,0xF13000929B00023D,"Рабочий Служителей Льда",0xa28,20066,"Покаяние",0x2,DEBUFF},

    ------------------------------48817------------------------------
    {2885,SPELL_CAST_SUCCESS,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000000000,nil,0x80000000,48817,"Гнев небес",0x2},
    {51443,SPELL_CAST_SUCCESS,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000000000,nil,0x80000000,48817,"Гнев небес",0x2},

    ------------------------------10308------------------------------
    {71068,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,10308,"Молот правосудия",0x2},
    {71132,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,10308,"Молот правосудия",0x2,DEBUFF},
    {72583,SPELL_AURA_REMOVED,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B4A,"Шаркающий ужас",0xa28,10308,"Молот правосудия",0x2,DEBUFF},
    {89801,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0xF130009342000B53,"Шаркающий ужас",0xa28,10308,"Молот правосудия",0x2},
    {120221,SPELL_CAST_SUCCESS,0x0000000000861755,"Kontez",0x528,0xF150008F01000B91,"Валь'кира - страж Тьмы",0xa28,10308,"Молот правосудия",0x2},
    {120299,SPELL_AURA_APPLIED,0x0000000000861755,"Kontez",0x528,0xF150008F01000B91,"Валь'кира - страж Тьмы",0xa28,10308,"Молот правосудия",0x2,DEBUFF},
    {120951,SPELL_AURA_REMOVED,0x0000000000861755,"Kontez",0x528,0xF150008F01000B91,"Валь'кира - страж Тьмы",0xa28,10308,"Молот правосудия",0x2,DEBUFF},

    ------------------------------66233------------------------------
    {180966,SPELL_AURA_REMOVED,0x0000000000403B45,"Jussed",0x528,0x0000000000403B45,"Jussed",0x528,66233,"Ревностный защитник",0x2,DEBUFF},
    {188287,SPELL_CAST_SUCCESS,0x0000000000403B45,"Jussed",0x528,0x0000000000000000,nil,0x80000000,66233,"Ревностный защитник",0x2},
    {2386690,SPELL_CAST_SUCCESS,0x00000000005EDF5D,"Capthor",0x528,0x0000000000000000,nil,0x80000000,66233,"Ревностный защитник",0x2},

    ------------------------------66235------------------------------
    {668710,SPELL_HEAL,0x000000000086248D,"Karlington",0x528,0x000000000086248D,"Karlington",0x528,66235,"Ревностный защитник",0x2,12434,0,0,nil},
    {1436248,SPELL_HEAL,0x00000000005B6841,"Аргентлайт",0x528,0x00000000005B6841,"Аргентлайт",0x528,66235,"Ревностный защитник",0x2,3399,0,0,nil},
    {2386689,SPELL_HEAL,0x00000000005EDF5D,"Capthor",0x528,0x00000000005EDF5D,"Capthor",0x528,66235,"Ревностный защитник",0x2,10713,0,0,nil},
    {2500787,SPELL_HEAL,0x000000000061A795,"Farengeitos",0x528,0x000000000061A795,"Farengeitos",0x528,66235,"Ревностный защитник",0x2,14176,0,0,nil},

    ------------------------------31789------------------------------
    {65223,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x000000000086AED3,"Папашасына",0x528,31789,"Праведная защита",0x2},
    {72704,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x00000000007C4C19,"Maiasel",0x528,31789,"Праведная защита",0x2},
    {75202,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x00000000007CEA4E,"Грустьбобра",0x528,31789,"Праведная защита",0x2},
    {81224,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x0000000000861755,"Kontez",0x528,31789,"Праведная защита",0x2},

    ------------------------------31821------------------------------
    {53351,SPELL_CAST_SUCCESS,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000000000,nil,0x80000000,31821,"Мастер аур",0x1},
    {53389,SPELL_AURA_APPLIED,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000867EE6,"Жиггулль",0x528,31821,"Мастер аур",0x1,BUFF},
    {54674,SPELL_AURA_REMOVED,0x0000000000867EE6,"Жиггулль",0x528,0x0000000000867EE6,"Жиггулль",0x528,31821,"Мастер аур",0x1,BUFF},
    {55281,SPELL_CAST_SUCCESS,0x0000000000861755,"Kontez",0x528,0x0000000000000000,nil,0x80000000,31821,"Мастер аур",0x1},

   ----------------------------------------------31884------------------------------------------------------
{   3350, SPELL_AURA_APPLIED,0x000000000036CE1F,"Assuranse",0x528,0x000000000036CE1F,"Assuranse",0x528,31884,"Гнев карателя",0x2,BUFF},
{ 178701, SPELL_AURA_APPLIED,0x00000000008A7B1D,"Спарклин",0x528,0x00000000008A7B1D,"Спарклин",0x528,31884,"Гнев карателя",0x2,BUFF},
    ------------------------------498------------------------------
    {82827,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x0000000000000000,nil,0x80000000,498,"Божественная защита",0x2},
    {82848,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0x000000000086EA84,"Жиггулль",0x528,498,"Божественная защита",0x2,BUFF},
    {909375,SPELL_AURA_APPLIED,0x0000000000864E39,"Нина",0x528,0x0000000000864E39,"Нина",0x528,498,"Божественная защита",0x2,BUFF},

    ------------------------------642------------------------------
    {58561,SPELL_CAST_SUCCESS,0x0000000000867E95,"Voinkom",0x528,0x0000000000000000,nil,0x80000000,642,"Божественный щит",0x2},
    {58576,SPELL_AURA_APPLIED,0x0000000000867E95,"Voinkom",0x528,0x0000000000867E95,"Voinkom",0x528,642,"Божественный щит",0x2,BUFF},
    {537706,SPELL_AURA_APPLIED,0x00000000007D15A1,"Teisoheal",0x528,0x00000000007D15A1,"Teisoheal",0x528,642,"Божественный щит",0x2,BUFF},

    ------------------------------70940------------------------------
    {441570,SPELL_AURA_APPLIED,0x000000000086248D,"Karlington",0x528,0xF130004CD4000430,"Исчадие Тьмы",0x1128,70940,"Божественный страж",0x1,BUFF},
    {441627,SPELL_AURA_APPLIED,0x000000000086248D,"Karlington",0x528,0x00000000007D15A1,"Teisoheal",0x528,70940,"Божественный страж",0x1,BUFF},

    ------------------------------64205------------------------------
    {441569,SPELL_CAST_SUCCESS,0x000000000086248D,"Karlington",0x528,0x0000000000000000,nil,0x80000000,64205,"Священная жертва",0x1},
    {441607,SPELL_AURA_APPLIED,0x000000000086248D,"Karlington",0x528,0xF14034DC1400000B,"Tombrumbler",0x1128,64205,"Священная жертва",0x1,BUFF},

    ------------------------------19752------------------------------
    {1260758,SPELL_CAST_SUCCESS,0x000000000079A953,"Хулитопочка",0x528,0x0000000000793779,"Notokay",0x528,19752,"Божественное вмешательство",0x2},
    {1260759,SPELL_INSTAKILL,0x000000000079A953,"Хулитопочка",0x528,0x000000000079A953,"Хулитопочка",0x528,19752,"Божественное вмешательство",0x2},
    {1434025,SPELL_CAST_SUCCESS,0x00000000007C2886,"Merfln",0x528,0x00000000006451C8,"Shamobel",0x528,19752,"Божественное вмешательство",0x2},
    {1434026,SPELL_INSTAKILL,0x00000000007C2886,"Merfln",0x528,0x00000000007C2886,"Merfln",0x528,19752,"Божественное вмешательство",0x2},
    {1436107,SPELL_CAST_SUCCESS,0x0000000000858941,"Абанихавшоке",0x528,0x00000000006F0DE2,"Stimpey",0x528,19752,"Божественное вмешательство",0x2},
    {1436108,SPELL_INSTAKILL,0x0000000000858941,"Абанихавшоке",0x528,0x0000000000858941,"Абанихавшоке",0x528,19752,"Божественное вмешательство",0x2},
    {3208061,SPELL_CAST_SUCCESS,0x00000000007D0D7B,"Пивнойшакал",0x528,0x000000000041160D,"Топхпсдпсшам",0x528,19752,"Божественное вмешательство",0x2},
    {3208062,SPELL_INSTAKILL,0x00000000007D0D7B,"Пивнойшакал",0x528,0x00000000007D0D7B,"Пивнойшакал",0x528,19752,"Божественное вмешательство",0x2},

    ------------------------------54428------------------------------
    {71504,SPELL_CAST_SUCCESS,0x000000000086EA84,"Жиггулль",0x528,0x0000000000000000,nil,0x80000000,54428,"Святая клятва",0x2},
    {71517,SPELL_AURA_APPLIED,0x000000000086EA84,"Жиггулль",0x528,0x000000000086EA84,"Жиггулль",0x528,54428,"Святая клятва",0x2,BUFF},

    ------------------------------20233------------------------------
    {298881,SPELL_AURA_APPLIED,0x0000000000724E51,"Hildryg",0x528,0xF140680787000009,"днорекаунта",0x1128,20233,"Возложение рук",0x2,BUFF},
    {3332876,SPELL_AURA_APPLIED,0x0000000000867B37,"Дэнчоо",0x528,0x000000000065923E,"Exotiq",0x528,20233,"Возложение рук",0x2,BUFF},

    ------------------------------20236------------------------------
    {744795,SPELL_AURA_APPLIED,0x0000000000869CA9,"Лизамолот",0x528,0x00000000006B2738,"Critx",0x528,20236,"Возложение рук",0x2,BUFF},
    {1486724,SPELL_AURA_APPLIED,0x00000000007C2886,"Merfln",0x528,0x00000000008630EE,"Чукчукен",0x528,20236,"Возложение рук",0x2,BUFF},
    {1752201,SPELL_AURA_APPLIED,0x00000000007C2886,"Merfln",0x528,0xF140647707000031,"хильСЮДА",0x1128,20236,"Возложение рук",0x2,BUFF},
    ------------------------------------------------------------------------------------------
    ------------------------------PRIEST------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------48153------------------------------

    ------------------------------47788------------------------------
    {46942,SPELL_CAST_SUCCESS,0x0000000000862627,"Селлентия",0x528,0x000000000035A108,"Blizlike",0x528,47788,"Оберегающий дух",0x2},
    {46946,SPELL_AURA_APPLIED,0x0000000000862627,"Селлентия",0x528,0x000000000035A108,"Blizlike",0x528,47788,"Оберегающий дух",0x2,BUFF},
    {758292,SPELL_CAST_SUCCESS,0x000000000079C098,"Очкостя",0x528,0x0000000000670D93,"Поррешка",0x528,47788,"Оберегающий дух",0x2},
    {758293,SPELL_AURA_APPLIED,0x000000000079C098,"Очкостя",0x528,0x0000000000670D93,"Поррешка",0x528,47788,"Оберегающий дух",0x2,BUFF},

    ------------------------------6346------------------------------
    {383008,SPELL_CAST_SUCCESS,0x00000000007BA1D6,"Бабаканторы",0x528,0x00000000007BA1D6,"Бабаканторы",0x528,6346,"Защита от страха",0x2},
    {383011,SPELL_AURA_APPLIED,0x00000000007BA1D6,"Бабаканторы",0x528,0x00000000007BA1D6,"Бабаканторы",0x528,6346,"Защита от страха",0x2,BUFF},
    {383043,SPELL_CAST_SUCCESS,0x000000000079D6D6,"Karuha",0x528,0x000000000079D6D6,"Karuha",0x528,6346,"Защита от страха",0x2},
    {383044,SPELL_AURA_APPLIED,0x000000000079D6D6,"Karuha",0x528,0x000000000079D6D6,"Karuha",0x528,6346,"Защита от страха",0x2,BUFF},

    ------------------------------33206------------------------------
    {113216,SPELL_CAST_SUCCESS,0x0000000000862627,"Селлентия",0x528,0x00000000003028B1,"Хербородатый",0x528,33206,"Подавление боли",0x2},
    {113225,SPELL_AURA_APPLIED,0x0000000000862627,"Селлентия",0x528,0x00000000003028B1,"Хербородатый",0x528,33206,"Подавление боли",0x2,BUFF},
    {470987,SPELL_AURA_APPLIED,0x00000000008360F0,"Putenx",0x528,0x000000000047CC7F,"Аббадонт",0x528,33206,"Подавление боли",0x2,BUFF},
    {1061913,SPELL_CAST_SUCCESS,0x00000000007D70C5,"Дцоднакнопка",0x528,0x0000000000864E39,"Нина",0x528,33206,"Подавление боли",0x2},

    ------------------------------64901------------------------------
    {87780,SPELL_CAST_SUCCESS,0x0000000000862627,"Селлентия",0x528,0x0000000000000000,nil,0x80000000,64901,"Гимн надежды",0x2},
    {87781,SPELL_AURA_APPLIED,0x0000000000862627,"Селлентия",0x528,0x0000000000862627,"Селлентия",0x528,64901,"Гимн надежды",0x2,BUFF},
      {559892,SPELL_AURA_APPLIED,0x00000000006D4763,"Сисину",0x528,0x00000000006D4763,"Сисину",0x528,64901,"Гимн надежды",0x2,BUFF},
    {561254,SPELL_AURA_REMOVED,0x00000000006D4763,"Сисину",0x528,0x00000000006D4763,"Сисину",0x528,64901,"Гимн надежды",0x2,BUFF},

    ------------------------------64843------------------------------
    {52654,SPELL_CAST_SUCCESS,0x0000000000192A9C,"Deaddealerr",0x528,0x0000000000000000,nil,0x80000000,64843,"Божественный гимн",0x2},
    {52656,SPELL_AURA_APPLIED,0x0000000000192A9C,"Deaddealerr",0x528,0x0000000000192A9C,"Deaddealerr",0x528,64843,"Божественный гимн",0x2,BUFF},
    ------------------------------------------------------------------------------------------
    ------------------------------ROGUE------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------51722------------------------------
    {133462,SPELL_CAST_SUCCESS,0x0000000000861DD2,"Татаркавделе",0x528,0xF13000929B000256,"Рабочий Служителей Льда",0xa28,51722,"Долой оружие",0x1},
    {133473,SPELL_AURA_APPLIED,0x0000000000861DD2,"Татаркавделе",0x528,0xF13000929B000256,"Рабочий Служителей Льда",0xa28,51722,"Долой оружие",0x1,DEBUFF},
   
    ------------------------------57934------------------------------
    {536,SPELL_CAST_SUCCESS,0x0000000000863D2D,"Fuliker",0x528,0x00000000003028B1,"Хербородатый",0x528,57934,"Маленькие хитрости",0x1},
    {540,SPELL_AURA_APPLIED,0x0000000000863D2D,"Fuliker",0x528,0x0000000000863D2D,"Fuliker",0x528,57934,"Маленькие хитрости",0x1,BUFF},
  
    ------------------------------31224------------------------------
    {4398,SPELL_CAST_SUCCESS,0x0000000000863D2D,"Fuliker",0x528,0x0000000000000000,nil,0x80000000,31224,"Плащ Теней",0x1},
    {4425,SPELL_AURA_APPLIED,0x0000000000863D2D,"Fuliker",0x528,0x0000000000863D2D,"Fuliker",0x528,31224,"Плащ Теней",0x1,BUFF},
   
    ------------------------------1725------------------------------
    ------------------------------------------------------------------------------------------
    ------------------------------SHAMAN------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------2825------------------------------
    {49596,SPELL_CAST_SUCCESS,0x000000000040ABF8,"Олфа",0x528,0x0000000000000000,nil,0x80000000,2825,"Жажда крови",0x8},
    {49597,SPELL_AURA_APPLIED,0x000000000040ABF8,"Олфа",0x528,0xF130004CD4000B0A,"Исчадие Тьмы",0x1128,2825,"Жажда крови",0x8,BUFF},
    
    ------------------------------32182------------------------------
    {157523,SPELL_CAST_SUCCESS,0x00000000001F542B,"Allesany",0x528,0x0000000000000000,nil,0x80000000,32182,"Героизм",0x8},
    {157535,SPELL_AURA_APPLIED,0x00000000001F542B,"Allesany",0x528,0x0000000000696DC5,"Быкбыковская",0x528,32182,"Героизм",0x8,BUFF},
    
    ------------------------------16190------------------------------
    {89763,SPELL_CAST_SUCCESS,0x000000000040ABF8,"Олфа",0x528,0x0000000000000000,nil,0x80000000,16190,"Тотем прилива маны",0x1},
    {89765,SPELL_SUMMON,0x000000000040ABF8,"Олфа",0x528,0xF1300028E3000B5A,"Тотем прилива маны",0x1128,16190,"Тотем прилива маны",0x1},
   
    ------------------------------21169------------------------------
    {60174,SPELL_CAST_SUCCESS,0x000000000040ABF8,"Олфа",0x528,0x0000000000000000,nil,0x80000000,21169,"Перерождение",0x8},
    {742233,SPELL_CAST_SUCCESS,0x0000000000867DAA,"Зухато",0x528,0x0000000000000000,nil,0x80000000,21169,"Перерождение",0x8},
     ------------------------------------------------------------------------------------------
    ------------------------------WARLOCK------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------58887------------------------------
    {2010582,SPELL_CREATE,0x00000000006CDAA0,"Wowbitch",0x528,0xF11002F2900001A3,"Портал Душ",0x4128,58887,"Ритуал душ",0x20},
    {2387447,SPELL_CREATE,0x0000000000592AAC,"Ariqa",0x528,0xF11002F290000050,"Портал Душ",0x4128,58887,"Ритуал душ",0x20},

    ------------------------------698------------------------------
    {276604,SPELL_CREATE,0x00000000005E712F,"Ниггативный",0x528,0xF11002F63C000070,"Портал призыва",0x4128,698,"Ритуал призыва",0x20},
   {1438023,SPELL_CREATE,0x000000000085ED34,"Zhova",0x528,0xF11002F63C0000EA,"Портал призыва",0x4128,698,"Ритуал призыва",0x20},
     ------------------------------------------------------------------------------------------
    ------------------------------WARRIOR------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------355------------------------------
    {286807,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0xF1300093FE0002B5,"Прожорливое поганище",0xa28,355,"Провокация",0x1},
    {286810,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0xF1300093FE0002B5,"Прожорливое поганище",0xa28,355,"Провокация",0x1,DEBUFF},
   
    ------------------------------694------------------------------

    ------------------------------1161------------------------------

    ------------------------------6552------------------------------
    {104051,SPELL_CAST_SUCCESS,0x0000000000855AD6,"Sarmate",0x528,0xF150008F01000B6A,"Валь'кира - страж Тьмы",0xa28,6552,"Зуботычина",0x1},
    {636811,SPELL_MISSED,0x000000000051D97B,"Влупидолчик",0x528,0xF130008F13000364,"Гниломорд",0xa28,6552,"Зуботычина",0x1,IMMUNE},

    ------------------------------676------------------------------
    {315587,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0xF13000916C000340,"Воин Служителей Льда",0xa28,676,"Разоружение",0x1},
    {315616,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0xF13000916C000340,"Воин Служителей Льда",0xa28,676,"Разоружение",0x1,DEBUFF},
    
    ------------------------------12809------------------------------
    {331962,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0xF13000929B000149,"Рабочий Служителей Льда",0xa28,12809,"Оглушающий удар",0x1},
    {332277,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0xF13000929B000149,"Рабочий Служителей Льда",0xa28,12809,"Оглушающий удар",0x1,DEBUFF},
    
    ------------------------------3411------------------------------
    {325723,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0x00000000008673D3,"Котобродолёт",0x528,3411,"Вмешательство",0x1},
    {325752,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0x00000000008673D3,"Котобродолёт",0x528,3411,"Вмешательство",0x1,BUFF},
    
    ------------------------------12975------------------------------

    ------------------------------12976------------------------------

    ------------------------------871------------------------------
    {286926,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0x0000000000000000,nil,0x80000000,871,"Глухая оборона",0x1},
    {286935,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0x000000000010DD26,"Highqualityq",0x528,871,"Глухая оборона",0x1,BUFF},
   
    ------------------------------70845------------------------------

    ------------------------------2565------------------------------
    {286846,SPELL_CAST_SUCCESS,0x000000000010DD26,"Highqualityq",0x528,0x0000000000000000,nil,0x80000000,2565,"Блок щитом",0x1},
    {286849,SPELL_AURA_APPLIED,0x000000000010DD26,"Highqualityq",0x528,0x000000000010DD26,"Highqualityq",0x528,2565,"Блок щитом",0x1,BUFF},
  
    ------------------------------12323------------------------------

    ------------------------------5246------------------------------
    {760560,SPELL_CAST_SUCCESS,0x0000000000485345,"Psuxoz",0x528,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,5246,"Устрашающий крик",0x1},
    {760561,SPELL_MISSED,0x0000000000485345,"Psuxoz",0x528,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,5246,"Устрашающий крик",0x1,IMMUNE},
    {2655795,SPELL_AURA_APPLIED,0x0000000000431906,"Валякарабин",0x528,0xF13000943D000234,"Приверженец культа",0xa28,5246,"Устрашающий крик",0x1,DEBUFF},
    {2655797,SPELL_AURA_APPLIED,0x0000000000431906,"Валякарабин",0x528,0xF13000943D000236,"Приверженец культа",0xa28,5246,"Устрашающий крик",0x1,DEBUFF},
    ------------------------------------------------------------------------------------------
    ------------------------------Engineering------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------54861------------------------------
    {6524,SPELL_AURA_APPLIED,0x000000000086E754,"Дцпе",0x528,0x000000000086E754,"Дцпе",0x528,54861,"Нитроускорители",0x1,BUFF},
    {279070,SPELL_AURA_APPLIED,0x0000000000863873,"Яжепросторог",0x528,0x0000000000863873,"Яжепросторог",0x528,54861,"Нитроускорители",0x1,BUFF},

    ------------------------------22700------------------------------

    ------------------------------44389------------------------------

    ------------------------------67826------------------------------

    ------------------------------54710------------------------------
    {1072935,SPELL_CAST_SUCCESS,0x0000000000792F23,"Rosset",0x528,0x0000000000000000,nil,0x80000000,54710,"МЯЛЛ-И",0x1},
    {1072936,SPELL_CREATE,0x0000000000792F23,"Rosset",0x528,0xF11002EC7500010C,"Переносной почтовый ящик",0x4128,54710,"МЯЛЛ-И",0x1},

    ------------------------------54711------------------------------
    ------------------------------------------------------------------------------------------
    ------------------------------Accessories------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------71638------------------------------
    {18491,SPELL_CAST_SUCCESS,0x00000000003028B1,"Хербородатый",0x528,0x0000000000000000,nil,0x80000000,71638,"Эгида Даларана",0x1},
    {18501,SPELL_AURA_APPLIED,0x00000000003028B1,"Хербородатый",0x528,0x00000000003028B1,"Хербородатый",0x528,71638,"Эгида Даларана",0x1,BUFF},
       ------------------------------------------------------------------------------------------
    ------------------------------MagicPortals------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------53142------------------------------
  
    {3373394,SPELL_CREATE,0x000000000077B9EC,"Лсд",0x528,0xF11002EABC0001F1,"Портал в Даларан",0x4128,53142,"Портал в Даларан",0x40},
    {3373783,SPELL_CREATE,0x0000000000312B81,"Frostyk",0x528,0xF11002EABC0001F2,"Портал в Даларан",0x4128,53142,"Портал в Даларан",0x40},

    ------------------------------11419------------------------------

    ------------------------------32266------------------------------

    ------------------------------11416------------------------------

    ------------------------------11417------------------------------

    ------------------------------33691------------------------------

    ------------------------------35717------------------------------

    ------------------------------32267------------------------------

    ------------------------------49361------------------------------

    ------------------------------10059------------------------------

    ------------------------------49360------------------------------

    ------------------------------11420------------------------------

    ------------------------------11418------------------------------
    ------------------------------------------------------------------------------------------
    ------------------------------Food------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------57426------------------------------
   
    {136757,SPELL_CREATE,0x00000000007157AC,"Вынимайлеща",0x528,0xF11002F0A3000066,"Рыбный пир",0x4128,57426,"Рыбный пир",0x1},
 
    ------------------------------57301------------------------------

    ------------------------------66476------------------------------
    ------------------------------------------------------------------------------------------
    ------------------------------ICC25HM------------------------------
    ------------------------------------------------------------------------------------------

    ------------------------------74320------------------------------
    {2007860,SPELL_AURA_APPLIED,0x0000000000000000,nil,0x80000000,0xF130008EF5000410,"Король-лич",0xa28,74320,"Жнец душ",0x20,DEBUFF},
    {2007861,SPELL_AURA_APPLIED_DOSE,0x0000000000000000,nil,0x80000000,0xF130008EF5000410,"Король-лич",0xa28,74320,"Жнец душ",0x20,DEBUFF,2},
    {2007864,SPELL_AURA_REMOVED,0x0000000000000000,nil,0x80000000,0xF130008EF5000410,"Король-лич",0xa28,74320,"Жнец душ",0x20,DEBUFF},
    {2007865,SPELL_AURA_APPLIED,0x0000000000000000,nil,0x80000000,0xF130008EF5000410,"Король-лич",0xa28,74320,"Жнец душ",0x20,DEBUFF},
    {2009211,SPELL_AURA_REMOVED,0x0000000000000000,nil,0x80000000,0xF130008EF5000410,"Король-лич",0xa28,74320,"Жнец душ",0x20,DEBUFF},

    ------------------------------73797------------------------------
    {105704,SPELL_CAST_SUCCESS,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21},
    {105706,SPELL_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,17427,0,33,8785,0,17715,nil,nil,nil},
    {105729,SPELL_AURA_APPLIED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {106590,SPELL_PERIODIC_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,13002,0,33,0,0,8951,nil,nil,nil},
    {106591,SPELL_AURA_REMOVED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {111811,SPELL_CAST_SUCCESS,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21},
    {111812,SPELL_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,19115,0,33,8688,0,15638,nil,nil,nil},
    {111816,SPELL_AURA_APPLIED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {112774,SPELL_PERIODIC_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,47160,0,33,0,0,3706,nil,nil,nil},
    {112775,SPELL_AURA_REMOVED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {118023,SPELL_CAST_SUCCESS,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21},
    {118024,SPELL_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,32214,0,33,13806,0,0,nil,nil,nil},
    {118033,SPELL_AURA_APPLIED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {118679,SPELL_PERIODIC_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,49921,0,33,0,0,3623,nil,nil,nil},
    {118681,SPELL_AURA_REMOVED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {123952,SPELL_CAST_SUCCESS,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21},
    {123953,SPELL_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,29509,0,33,8678,0,5207,nil,nil,nil},
    {123957,SPELL_AURA_APPLIED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {124584,SPELL_PERIODIC_DAMAGE,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,38804,0,33,0,0,12062,nil,nil,nil},
    {124585,SPELL_AURA_REMOVED,0xF130008EF5000B1C,"Король-лич",0xa28,0x00000000003028B1,"Хербородатый",0x528,73797,"Жнец душ",0x21,DEBUFF},
    {2212703,SPELL_CAST_SUCCESS,0xF130008EF50007EE,"Король-лич",0xa28,0x00000000006A64DB,"Poofpoofqq",0x528,73797,"Жнец душ",0x21},

    ------------------------------73798------------------------------
    {2169425,SPELL_CAST_SUCCESS,0xF130008EF50005B3,"Король-лич",0xa28,0x00000000007BA2DB,"Ливгард",0x528,73798,"Жнец душ",0x21},
    {2169426,SPELL_DAMAGE,0xF130008EF50005B3,"Король-лич",0xa28,0x00000000007BA2DB,"Ливгард",0x528,73798,"Жнец душ",0x21,33796,0,33,8448,0,0,nil,nil,nil},
    {2169430,SPELL_AURA_APPLIED,0xF130008EF50005B3,"Король-лич",0xa28,0x00000000007BA2DB,"Ливгард",0x528,73798,"Жнец душ",0x21,DEBUFF},
    {2169945,SPELL_PERIODIC_DAMAGE,0xF130008EF50005B3,"Король-лич",0xa28,0x00000000007BA2DB,"Ливгард",0x528,73798,"Жнец душ",0x21,11730,0,33,0,0,43470,nil,nil,nil},
    {2169947,SPELL_AURA_REMOVED,0xF130008EF50005B3,"Король-лич",0xa28,0x00000000007BA2DB,"Ливгард",0x528,73798,"Жнец душ",0x21,DEBUFF},

    ------------------------------73799------------------------------
    {1942080,SPELL_CAST_SUCCESS,0xF130008EF5000410,"Король-лич",0xa28,0x00000000005B6841,"Аргентлайт",0x528,73799,"Жнец душ",0x21},
    {1942082,SPELL_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x00000000005B6841,"Аргентлайт",0x528,73799,"Жнец душ",0x21,30733,0,33,14354,0,2761,nil,nil,nil},
    {1942089,SPELL_AURA_APPLIED,0xF130008EF5000410,"Король-лич",0xa28,0x00000000005B6841,"Аргентлайт",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1943721,SPELL_PERIODIC_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x00000000005B6841,"Аргентлайт",0x528,73799,"Жнец душ",0x21,48043,0,33,0,0,0,nil,nil,nil},
    {1943722,SPELL_AURA_REMOVED,0xF130008EF5000410,"Король-лич",0xa28,0x00000000005B6841,"Аргентлайт",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1952112,SPELL_CAST_SUCCESS,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21},
    {1952114,SPELL_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,12737,0,33,4948,0,7055,nil,nil,nil},
    {1952146,SPELL_AURA_APPLIED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1953516,SPELL_PERIODIC_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,10398,0,33,0,0,11041,nil,nil,nil},
    {1953517,SPELL_AURA_REMOVED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1962271,SPELL_CAST_SUCCESS,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21},
    {1962273,SPELL_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,28853,0,33,14213,0,28001,nil,nil,nil},
    {1962293,SPELL_AURA_APPLIED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1963785,SPELL_PERIODIC_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,15440,0,33,0,0,47028,nil,nil,nil},
    {1963786,SPELL_AURA_REMOVED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1972061,SPELL_CAST_SUCCESS,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21},
    {1972062,SPELL_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,35090,0,33,23393,0,0,nil,nil,nil},
    {1972080,SPELL_AURA_APPLIED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1973002,SPELL_PERIODIC_DAMAGE,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,32709,0,33,0,0,22262,nil,nil,nil},
    {1973003,SPELL_AURA_REMOVED,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21,DEBUFF},
    {1980496,SPELL_CAST_SUCCESS,0xF130008EF5000410,"Король-лич",0xa28,0x000000000036F1AB,"Egorkadk",0x528,73799,"Жнец душ",0x21},

    ------------------------------71726------------------------------

    ------------------------------71729------------------------------
    {502081,SPELL_CAST_SUCCESS,0xF1300094430003A0,"Кровавая королева Лана'тель",0xa28,0x00000000000538CD,"Charmingg",0x528,71729,"Укус вампира",0x1},
    {502180,SPELL_DAMAGE,0xF1300094430003A0,"Кровавая королева Лана'тель",0xa28,0x00000000000538CD,"Charmingg",0x528,71729,"Укус вампира",0x1,7670,0,1,0,0,0,nil,nil,nil},
    {1176904,SPELL_CAST_SUCCESS,0xF1300094430003BC,"Кровавая королева Лана'тель",0xa28,0x00000000006E9541,"Zaklinilo",0x528,71729,"Укус вампира",0x1},
    {1177103,SPELL_DAMAGE,0xF1300094430003BC,"Кровавая королева Лана'тель",0xa28,0x00000000006E9541,"Zaklinilo",0x528,71729,"Укус вампира",0x1,8679,0,1,0,0,1583,nil,nil,nil},
    {1617050,SPELL_CAST_SUCCESS,0xF1300094430003ED,"Кровавая королева Лана'тель",0xa28,0x0000000000115500,"Strengh",0x528,71729,"Укус вампира",0x1},
    {1617150,SPELL_DAMAGE,0xF1300094430003ED,"Кровавая королева Лана'тель",0xa28,0x0000000000115500,"Strengh",0x528,71729,"Укус вампира",0x1,3137,0,1,0,0,7104,nil,nil,nil},
    {2350278,SPELL_CAST_SUCCESS,0xF130009443000587,"Кровавая королева Лана'тель",0xa28,0x0000000000659B9E,"Берликк",0x528,71729,"Укус вампира",0x1},
    {2350386,SPELL_DAMAGE,0xF130009443000587,"Кровавая королева Лана'тель",0xa28,0x0000000000659B9E,"Берликк",0x528,71729,"Укус вампира",0x1,309,0,1,0,0,10966,nil,nil,nil},
    {2865766,SPELL_CAST_SUCCESS,0xF130009443000485,"Кровавая королева Лана'тель",0xa28,0x00000000005591C2,"Комбатгерл",0x528,71729,"Укус вампира",0x1},
    {2865971,SPELL_DAMAGE,0xF130009443000485,"Кровавая королева Лана'тель",0xa28,0x00000000005591C2,"Комбатгерл",0x528,71729,"Укус вампира",0x1,595,0,1,0,0,8156,nil,nil,nil},

    ------------------------------71727------------------------------

    ------------------------------71728------------------------------

    ------------------------------71475------------------------------

    ------------------------------71476------------------------------

    ------------------------------71477------------------------------
    {525381,SPELL_CAST_SUCCESS,0x00000000000538CD,"Charmingg",0x528,0x00000000007FF157,"Nadarzyn",0x528,71477,"Укус вампира",0x1},
    {1226103,SPELL_CAST_SUCCESS,0x00000000005F7329,"Armagedosha",0x528,0x00000000007934FE,"Dichtop",0x528,71477,"Укус вампира",0x1},

    ------------------------------70946------------------------------


    ------------------------------71289------------------------------
    {nil,SPELL_AURA_APPLIED,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,0x0000000000793555,"Poterpevshiu",0x528,71289,"Господство над разумом",0x20,DEBUFF},
    {nil,SPELL_AURA_APPLIED,0xF130008FF70000BF,"Леди Смертный Шепот",0xa28,0x000000000079BC91,"Zulthar",0x528,71289,"Господство над разумом",0x20,DEBUFF},
    
    ------------------------------72148------------------------------
    {1891921,SPELL_CAST_START,0xF130009342000952,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},
    {1892266,SPELL_AURA_APPLIED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1892561,SPELL_AURA_REMOVED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1892562,SPELL_DISPEL,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000952,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},
    {1898981,SPELL_CAST_START,0xF130009342000952,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},
    {1899290,SPELL_AURA_APPLIED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1899611,SPELL_AURA_REMOVED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1899612,SPELL_DISPEL,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000952,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},
    {1905835,SPELL_CAST_START,0xF130009342000952,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},
    {1906157,SPELL_AURA_APPLIED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1906463,SPELL_AURA_REMOVED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1906464,SPELL_DISPEL,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000952,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},
    {1909928,SPELL_CAST_START,0xF130009342000961,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},
    {1910234,SPELL_AURA_APPLIED,0xF130009342000961,"Шаркающий ужас",0xa28,0xF130009342000961,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1910627,SPELL_AURA_REMOVED,0xF130009342000961,"Шаркающий ужас",0xa28,0xF130009342000961,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1910628,SPELL_DISPEL,0x00000000007D24A5,"Playboymodel",0x528,0xF130009342000961,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},
    {1916669,SPELL_CAST_START,0xF130009342000961,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},
    {1916987,SPELL_AURA_APPLIED,0xF130009342000961,"Шаркающий ужас",0xa28,0xF130009342000961,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1917182,SPELL_AURA_REMOVED,0xF130009342000961,"Шаркающий ужас",0xa28,0xF130009342000961,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1917183,SPELL_DISPEL,0x0000000000814487,"Lemyp",0x528,0xF130009342000961,"Шаркающий ужас",0xa28,19801,"Усмиряющий выстрел",0x8,72148,"Исступление",1,BUFF},
    {2025589,SPELL_CAST_START,0xF130009342000AAA,"Шаркающий ужас",0xa28,0x0000000000000000,nil,0x80000000,72148,"Исступление",0x1},

    ------------------------------28747------------------------------
    {178477,SPELL_AURA_APPLIED,0xF1300093420006D3,"Шаркающий ужас",0xa28,0xF1300093420006D3,"Шаркающий ужас",0xa28,28747,"Бешенство",0x1,BUFF},
    {1909997,SPELL_AURA_APPLIED,0xF130009342000952,"Шаркающий ужас",0xa28,0xF130009342000952,"Шаркающий ужас",0xa28,28747,"Бешенство",0x1,BUFF},
    

        ------------------------------2782------------------------------
    {1,SPELL_DISPEL,0x0000000000671A72,"Обажаемый",0x528,0x0000000000712545,"Fulldpsgood",0x528,2782,"Снятие проклятия",0x40,71237,"Проклятие оцепенения",32,BUFF},
    {20,SPELL_DISPEL,0x0000000000671A72,"Обажаемый",0x528,0x00000000008175E1,"Мякс",0x528,2782,"Снятие проклятия",0x40,71237,"Проклятие оцепенения",32,BUFF},
    ------------------------------526------------------------------
    {2,SPELL_DISPEL,0x000000000085CE3B,"Водянойщит",0x528,0x0000000000182882,"Промицин",0x528,526,"Оздоровление",0x8,67934,"Озноб",16,BUFF},
    {3,SPELL_DISPEL,0x000000000085CE3B,"Водянойщит",0x528,0x000000000019F07D,"Злаядуша",0x528,526,"Оздоровление",0x8,67934,"Озноб",16,BUFF},
   
    ------------------------------4987------------------------------
    {4,SPELL_DISPEL,0x0000000000182882,"Промицин",0x528,0x00000000008175E1,"Мякс",0x528,4987,"Очищение",0x2,48300,"Всепожирающая чума",32,BUFF},
    {12,SPELL_DISPEL_FAILED,0x0000000000182882,"Промицин",0x528,0x0000000000671A72,"Обажаемый",0x528,4987,"Очищение",0x2,55095,"Озноб",16},
    {13,SPELL_DISPEL,0x0000000000182882,"Промицин",0x528,0x0000000000671A72,"Обажаемый",0x528,4987,"Очищение",0x2,51735,"Черная чума",32,BUFF},
   
    ------------------------------51886------------------------------
    {10,SPELL_DISPEL,0x0000000000860AC9,"Sunsleep",0x528,0x0000000000860AC9,"Sunsleep",0x528,51886,"Очищение духа",0x8,55095,"Озноб",16,BUFF},
    {11,SPELL_DISPEL_FAILED,0x0000000000860AC9,"Sunsleep",0x528,0x0000000000671A72,"Обажаемый",0x528,51886,"Очищение духа",0x8,55095,"Озноб",16},
    {31,SPELL_DISPEL,0x0000000000860AC9,"Sunsleep",0x528,0x0000000000860AC9,"Sunsleep",0x528,51886,"Очищение духа",0x8,48300,"Всепожирающая чума",32,BUFF},
 
    ------------------------------32375------------------------------
    {14,SPELL_DISPEL,0x000000000040C4E2,"Trylolpro",0x528,0x000000000085CE3B,"Водянойщит",0x528,32375,"Массовое рассеивание",0x2,72908,"Залп ледяных стрел",16,BUFF},
    {53,SPELL_DISPEL,0x000000000041137E,"Палюлю",0x528,0x000000000085AB28,"Чипсиик",0x528,32375,"Массовое рассеивание",0x2,73070,"Внушение страха",32,BUFF},
    {67,SPELL_DISPEL,0x00000000008577CA,"Яботяра",0x548,0x0000000000868B3F,"Fetulik",0x1218,32375,"Массовое рассеивание",0x2,10890,"Ментальный крик",32,BUFF},
    ------------------------------32592------------------------------
    {17,SPELL_DISPEL,0x000000000040C4E2,"Trylolpro",0x528,0x00000000007986B9,"Сикисикии",0x1228,32592,"Массовое рассеивание",0x2,48066,"Слово силы: Щит",2,BUFF},
    {42,SPELL_DISPEL,0x00000000005811D6,"Laptik",0x528,0xF130009402000451,"Фанатик культа",0xa28,32592,"Массовое рассеивание",0x2,70674,"Сила вампира",32,BUFF},
    {66,SPELL_DISPEL,0x00000000008577CA,"Яботяра",0x548,0x00000000005CD7BB,"Nigest",0x1218,32592,"Массовое рассеивание",0x2,57960,"Водный щит",8,BUFF},
    ------------------------------988------------------------------
    {48,SPELL_DISPEL,0x000000000041137E,"Палюлю",0x528,0x00000000002F52D4,"Тамара",0x10528,988,"Рассеивание заклинаний",0x2,48160,"Прикосновение вампира",32,BUFF},
    {92,SPELL_DISPEL,0x000000000056B37D,"Дворжик",0x528,0x0000000000748029,"Tirititu",0x528,988,"Рассеивание заклинаний",0x2,71153,"Огненный шар",4,BUFF},
    ------------------------------552------------------------------
    {55,SPELL_DISPEL,0x00000000006EA135,"Soskapushka",0x512,0x000000000078B8A5,"Темныйкнязь",0x514,552,"Устранение болезни",0x2,67934,"Озноб",16,BUFF},
    {56,SPELL_DISPEL,0x00000000006EA135,"Soskapushka",0x512,0x0000000000735EA1,"Onlypower",0x280514,552,"Устранение болезни",0x2,67934,"Озноб",16,BUFF},
    ------------------------------48011------------------------------
    {64,SPELL_DISPEL,0xF1405F9A46000006,"Ghaafum",0x1114,0x00000000006F0946,"Erraa",0x514,48011,"Пожирание магии",0x20,72908,"Залп ледяных стрел",16,BUFF},
    {70,SPELL_DISPEL,0xF1405F9A4600000A,"Ghaafum",0x1114,0x00000000006F0946,"Erraa",0x514,48011,"Пожирание магии",0x20,72908,"Залп ледяных стрел",16,BUFF},
   
    ------------------------------528------------------------------
    {69,SPELL_DISPEL,0x00000000008577CA,"Яботяра",0x514,0x00000000002F58C1,"Shesa",0x514,528,"Излечение болезни",0x2,67934,"Озноб",16,BUFF},
    {96,SPELL_DISPEL_FAILED,0x0000000000827CE5,"Дивайна",0x528,0x0000000000675CA2,"Ssyslik",0x528,528,"Излечение болезни",0x2,55095,"Озноб",16},
    {98,SPELL_DISPEL_FAILED,0x0000000000827CE5,"Дивайна",0x528,0x00000000007FF467,"Phlore",0x528,528,"Излечение болезни",0x2,55078,"Кровавая чума",32},
    ------------------------------19801------------------------------
    {71,SPELL_DISPEL,0x0000000000862BCB,"Youkike",0x800514,0xF130009B4300002C,"Савиана Огненная Пропасть",0x10a48,19801,"Усмиряющий выстрел",0x8,78722,"Исступление",1,BUFF},
   
    ------------------------------475------------------------------
    {76,SPELL_DISPEL,0x0000000000863E42,"Кловнзхс",0x4000514,0x0000000000863E42,"Кловнзхс",0x4000514,475,"Снятие проклятия",0x40,74795,"Метка пожирания",32,BUFF},
    {122,SPELL_DISPEL,0x000000000015744C,"Аленадавай",0x528,0x000000000015744C,"Аленадавай",0x528,475,"Снятие проклятия",0x40,74795,"Метка пожирания",32,BUFF},
  
    ------------------------------10872------------------------------
    {102,SPELL_DISPEL,0x00000000007B1981,"Lapantera",0x528,0x00000000007B1981,"Lapantera",0x528,10872,"Эффект устранения болезни",0x8,55095,"Озноб",16,BUFF},
    {104,SPELL_DISPEL,0x0000000000862140,"Zlzlz",0x528,0x00000000006B05EA,"Arzdg",0x528,10872,"Эффект устранения болезни",0x8,73786,"Мертвящая чума",32,BUFF},
    ------------------------------2893------------------------------
    {108,SPELL_DISPEL,0x0000000000855E48,"Serguad",0x528,0x00000000008673D3,"Котобродолёт",0x528,2893,"Устранение яда",0x8,36984,"Укус змеи",8,BUFF},
    ------------------------------3137------------------------------
    {109,SPELL_DISPEL,0x0000000000855E48,"Serguad",0x528,0x00000000008673D3,"Котобродолёт",0x528,3137,"Эффект устранения яда",0x8,36984,"Укус змеи",8,BUFF},
    ------------------------------1152------------------------------
    {110,SPELL_DISPEL,0x00000000007D15A1,"Teisoheal",0x528,0x000000000082AAE0,"Нутелочка",0x528,1152,"Омовение",0x2,6411,"Яд скорпида",8,BUFF},
    ------------------------------57767------------------------------
    {111,SPELL_DISPEL,0xF13000960A0003C0,"Страждущая душа",0xa28,0xF1300090EA000352,"Валь'кира-глашатай",0xa28,57767,"Очищение",0x2,57970,"Смертельный яд IX",8,BUFF},

---------------------------------72148--------------------------
    {1231224,SPELL_AURA_APPLIED,0xF130009342000BC8,"Шаркающий ужас",0xa28,0xF130009342000BC8,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    {1231224,SPELL_AURA_APPLIED,0xF130009342000BC8,"Шаркающий ужас",0xa28,0xF130009342000BC8,"Шаркающий ужас",0xa28,72148,"Исступление",0x1,BUFF},
    
--------------------------------71264--------------------------

    {  97609,  SPELL_CAST_SUCCESS,0xF1300094430004B4,"Кровавая королева Лана'тель",0x10a48,0x00000000001003FD,"Сантамуэртэ",0x512,71264,"Роящиеся тени",0x20},
    {  98400,  SPELL_CAST_SUCCESS,0xF1300094430004B4,"Кровавая королева Лана'тель",0x10a48,0x0000000000134CA2,"Gruppakorni",0x514,71264,"Роящиеся тени",0x20},
---------------------------------73914--------------------------

    {212395, SPELL_CAST_SUCCESS,0xF130008EF500093A,"Король-лич",0xa28,0x000000000018A9EE,"Сержунька",0x528,73914,"Мертвящая чума",0x20 },
    {213373, SPELL_CAST_SUCCESS,0xF130008EF500093A,"Король-лич",0xa28,0x00000000006A6053,"Allenor",0x528,73914,"Мертвящая чума",0x20 },
---------------------------------59752--------------------------
{429,  SPELL_CAST_SUCCESS,0x00000000000E3737,"Holysshitt",0x514,0x0000000000000000,nil,0x80000000,59752,"Каждый за себя",0x1},
{23123,SPELL_CAST_SUCCESS,0x00000000000D108A,"Зубочка",0x512,0x0000000000000000,nil,0x80000000,59752,"Каждый за себя",0x1},

};
