


ns.spellsNew = {
    --DEATHKNIGHT = {
        [56222] = true, -- [Темная власть]
        [55233] = true, -- [Кровь вампира]
        [42650] = true, -- [Войско мертвых]
        [48792] = true, -- [Незыблемость льда]
        [48982] = true, -- [Захват рун]
        [70654] = true, -- [Кровавый доспех]
        [47528] = true, -- [Заморозка разума]
        [48707] = true, -- [Антимагический панцирь]
        [49576] = true, -- [Хватка смерти]
        [51271] = true, -- [Несокрушимая броня]
        [48743] = true, -- [Смертельный союз]
        [49016] = true, -- [Истерия]
        [47476] = true, -- [Удушение]
        [49005] = true, -- [Кровавая метка]
    
    
    
    --DRUID = {
        [61336] = true, -- [Инстинкты выживания]
        [22812] = true, -- [Дубовая кожа]
      --  [48477] = true, -- [Возрождение]
        [48447] = true, -- [Спокойствие]
        [53227] = true, -- [Тайфун]
        [8983] = true, -- [Оглушить]
        [6795] = true, -- [Рык]
        [5209] = true, -- [Вызывающий рев]
        [29166] = true, -- [Озарение]
        [70725] = true, -- [4P T10]
    
    --HUNTER = {
        [34477] = true, -- [Перенаправление]
        [13809] = true, -- [Ледяная ловушка]
        [23989] = true, -- [Готовность]
        [19801] = true, -- [Усмиряющий выстрел]
        [20736] = true, -- [Отвлекающий выстрел]
        [34600] = true, -- [Змеиная ловушка]
    
    --MAGE = {
        [66] = true, -- [Невидимость]
        [31687] = true, -- [Призыв элементаля воды]
        [45438] = true, -- [Ледяная глыба]
        [475] = true, -- [Снятие проклятия]
        [2139] = true, -- [Антимагия]
    
    --PALADIN = {
        [31790] = true, -- Праведная защита пал
        [62124] = true, -- [Длань возмездия]
    
        [1044] = true, -- [Длань свободы]
        [1038] = true, -- [Длань спасения]
        [6940] = true, -- [Длань жертвенности]
        [10278] = true, -- [Длань защиты]
        
        [20066] = true, -- [Покаяние]
    
        [48817] = true, -- [Гнев небес]
        [10308] = true, -- [Молот правосудия]
        
       -- [31850] = true, -- Ревностный защитник
        [66233] = true, -- [Ревностный защитник]
        
        [31789] = true, -- [Праведная защита]
        [31821] = true, -- [Мастер аур]
        --[31884] = true, -- крылья
        --[53601] = true, -- [Священный щит]
        [498] = true, -- 50 на 50
        
        [642] = true, -- бабл
    
        [70940] = true, -- [Божественный страж]
        [64205] = true, -- масс сакра
        --[31842] = true, -- [Божественное просветление]
    
        [19752] = true, -- диван
        
        [54428] = true, -- [Святая клятва]
       -- [48788] = true, -- [Возложение рук]
        [20233] = true, -- Возложение рук
        [20236] = true, -- Возложение рук
    
    --PRIEST = {
        [47788] = true, -- [Оберегающий дух]
        [6346] = true, -- [Защита от страха]
        [33206] = true, -- [Подавление боли]
    
        [64901] = true, -- [Гимн надежды]
        [64843] = true, -- [Божественный гимн]
        
        -- [8122] = true, -- [Ментальный крик]
        -- [15487] = true, -- [Безмолвие]
        -- [34433] = true, -- [Исчадие Тьмы]
        -- [724] = true, -- [Колодец Света]
        -- [64044] = true, -- [Глубинный ужас]
        -- [10890] = true, -- [Ментальный крик]
    
        -- [586] = true, -- [Уход в тень]
    
        -- [10060] = true, -- [Придание сил]
    
        -- [47585] = true, -- [Слияние с Тьмой]
       -- [48113] = true, -- [Молитва восстановления]
    
       -- ROGUE = {
        [51722] = true, -- [Долой оружие]
        [57934] = true, -- [Маленькие хитрости]
           
        -- [26669] = true, -- [Ускользание]
        -- [13877] = true, -- [Шквал клинков]
        -- [48659] = true, -- [Ложный выпад]
        -- [1856] = true, -- [Исчезновение]
        -- [11305] = true, -- [Спринт]
        -- [26889] = true, -- [Исчезновение]
        -- [1766] = true, -- [Пинок]
        -- [5277] = true, -- [Ускользание]
        -- [2094] = true, -- [Ослепление]
        -- [13750] = true, -- [Выброс адреналина]
        -- [8643] = true, -- [Удар по почкам]
        -- [14185] = true, -- [Подготовка]
        -- [51690] = true, -- [Череда убийств]
        [31224] = true, -- [Плащ Теней]
        [1725] = true, -- [Отвлечение]
    
    --SHAMAN = {
        [2825] = true, -- [Жажда крови]
        [32182] = true, -- [Героизм]
        [16190] = true, -- [Тотем прилива маны]
        [21169] = true, -- [Перерождение]
    
        -- [16188] = true, -- [Природная стремительность]
        -- [51533] = true, -- [Дух дикого волка]
        -- [16166] = true, -- [Покорение стихий]
        -- [57994] = true, -- [Пронизывающий ветер]
        -- [30823] = true, -- [Ярость шамана]
        -- [59159] = true, -- [Гром и молния]
    
        -- [51514] = true, -- [Сглаз]
        -- [20608] = true, -- [Перерождение]
        -- [2894] = true, -- [Тотем элементаля огня]
        -- [2062] = true, -- [Тотем элементаля земли]
    --WARLOCK = {
        [58887] = true, -- Ритуал душ
        [698]	= true,	-- Ритуал призыва
    
        -- [47241] = true, -- [Метаморфоза]
        -- [1122] = true, -- [Инфернал]
        -- [18540] = true, -- [Ритуал Рока]
        -- [29858] = true, -- [Раскол души]
        -- [47883] = true, -- [Воскрешение камнем души]
        -- [47891] = true, -- [Заслон от темной магии]
        -- [29893] = true, -- [Ритуал душ]
        -- [698] = true, -- [Ритуал призыва]
        -- [6203] = true, -- [Камень души]
    
    -- WARRIOR
    
        [355] = true, -- [Провокация]
        [1161] = true, -- [Вызывающий крик] -- таунт
    
        [6552] = true, -- [Зуботычина]
        
        [676] = true, -- [Разоружение]
    
        --[55694] = true, -- [Безудержное восстановление]
        [12809] = true, -- [Оглушающий удар]
        [3411] = true, -- [Вмешательство]
        [12975] = true, -- [Ни шагу назад]
        [871] = true, -- [Глухая оборона]
        [70845] = true, -- [Стоицизм] т10
    
        [2565] = true, -- [Блок щитом]
        [12323] = true, -- [Пронзительный вой]
    
        [5246] = true, -- устрашающий-крик
    
            -- инженерка
        [22700] = true,
        [44389] = true,
        [67826] = true,
        [54710] = true,
        [54711] = true,
    
            -- Trinkets 
        [71638] = true, -- Клык
    
        [53142] = true, -- Даларан
        [11419] = true, -- Дарнас
        [32266] = true, -- Экзодар
        [11416] = true, -- Стальгорн 
        [11417] = true, -- Огри 
        [33691] = true, -- Шатрат    
        [35717] = true, -- Шатрат  
        [32267] = true, -- Луносвет  
        [49361] = true, -- Каменор     
        [10059] = true, -- Шторм    
        [49360] = true, -- Терамор     
        [11420] = true, -- Громовой утес
        [11418] = true, -- Подгород   
    
          --eda
        [57426] = true, -- Рыбный пир
        [57301] = true, -- "Пир на весь мир"
        [66476] = true, -- Богатый пир
    
        -- бр 
        [20484] = true,
    }